princeton/ipvs/results/timeseries/time-scales/2_X_max/single-backend/500ms-fluctuation/3mins-run/600ms-feedback/feedback-wlc/3333-seed/run/httperf_client_123.log
httperf --verbose --hog --timeout=50 --client=0/1 --server=172.16.116.116 --port=8080 --uri=/ --rate=16 --send-buffer=4096 --recv-buffer=16384 --num-conns=2880 --num-calls=1
httperf: maximum number of open descriptors = 65535
Maximum connect burst length: 1

Connection lifetime histogram (time in ms):
             :
            10.5 82
            11.5 437
            12.5 253
            13.5 237
            14.5 251
            15.5 319
            16.5 451
            17.5 261
            18.5 158
            19.5 90
            20.5 80
            21.5 56
            22.5 41
            23.5 29
            24.5 21
            25.5 17
            26.5 9
            27.5 8
            28.5 9
            29.5 8
            30.5 7
            31.5 2
            32.5 5
            33.5 4
            34.5 1
             :
            36.5 2
            37.5 1
             :
            43.5 1
             :
            47.5 1
             :
            58.5 1
             :
            68.5 1
             :
            84.5 1
             :
            99.5 1
             :
           110.5 1
             :
           131.5 1
             :
           143.5 1
             :
           147.5 2
             :
           167.5 1
             :
           173.5 1
             :
           183.5 1
             :
           193.5 1
             :
           201.5 1
             :
           212.5 1
             :
           222.5 1
           223.5 1
             :
           228.5 1
             :
           231.5 1
             :
           239.5 1
             :
           243.5 1
             :
           247.5 1
           248.5 2
             :
           253.5 1
             :
           259.5 1
             :
           261.5 1
           262.5 1
             :
           264.5 1
             :
           268.5 1
             :
           272.5 1
             :
           291.5 1
             :
           294.5 2
             :
           321.5 1
             :
           343.5 1
             :
           362.5 1
             :
           374.5 1
             :
           394.5 1

Total: connections 2880 requests 2880 replies 2880 test-duration 179.951 s

Connection rate: 16.0 conn/s (62.5 ms/conn, <=2 concurrent connections)
Connection time [ms]: min 10.4 avg 18.6 max 394.1 median 15.5 stddev 26.3
Connection time [ms]: connect 0.9
Connection length [replies/conn]: 1.000

Request rate: 16.0 req/s (62.5 ms/req)
Request size [B]: 67.0

Reply rate [replies/s]: min 15.0 avg 16.0 max 17.0 stddev 0.2 (179 samples)
Percentages of the replies served at a given rate:
   50%: 15
   66%: 15
   75%: 15
   80%: 15
   90%: 15
   95%: 15
   98%: 16
   99%: 16
  100%: 17

Reply time [ms]: response 16.9 transfer 0.7
Percentages of the requests served within a certain time (ms) :
   50%: 14
   66%: 15
   75%: 15
   80%: 16
   90%: 18
   95%: 21
   98%: 27
   99%: 166
  100%: 369

Reply size [B]: header 162.0 content 72.0 footer 1.0 (total 235.0)
Reply status: 1xx=0 2xx=2880 3xx=0 4xx=0 5xx=0

CPU time [s]: user 149.46 system 30.12 (user 83.1% system 16.7% total 99.8%)
Net I/O: 4.7 KB/s (0.0*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0